[
  {
    "botanical_name": "Asclepias incarnata",
    "common_name": "Swamp milkweed",
    "plant_type": "Forb",
    "image": "/plantImgs/asclepias-incarnata.jpg",
    "url":"https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=g410",
    "description": "Asclepias incarnata, commonly called swamp milkweed, is an erect, clump-forming, Missouri native plant which is commonly found in swamps, river bottomlands and wet meadows throughout the State. It typically grows 3-4' tall (less frequently to 5') on branching stems. Small, fragrant, pink to mauve flowers (1/4\" wide), each with five reflexed petals and an elevated central crown, appear in tight clusters (umbels) at the stem ends in summer. Flowers are uncommonly white. Narrow, lance-shaped, taper-pointed leaves are 3-6\" long. Stems exude a toxic milky sap when cut. Flowers are followed by attractive seed pods (to 4\" long) which split open when ripe releasing silky-haired seeds easily carried by the wind. Flowers are very attractive to butterflies and hummingbirds as a nectar source. In addition, swamp milkweed is a food source for the larval stage of monarch butterflies.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "butterfly_garden": true,
    "height": "4–5",
    "bloom_time": "late summer",
    "rain_garden_wet": true,
    "rain_garden_dry": false,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Eutrochium purpureum",
    "common_name": "Purple Joe Pye",
    "plant_type": "Forb",
    "image": "/plantImgs/eutrochium-purpureum.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=c740",
    "description": "Eutrochium purpureum, commonly called Joe Pye weed, is a tall Missouri native perennial that occurs in low moist ground, wooded slopes, wet meadows and thickets and stream margins throughout the State (Steyermark). It is an erect, clump-forming perennial which typically grows 4-7’ tall and features coarsely-serrated, lance-shaped, dark green leaves (to 12” long) in whorls of 3-4 on sturdy green stems with purplish leaf nodes. Tiny, vanilla-scented, dull pinkish-purple flowers in large, terminal, domed, compound inflorescences bloom in mid-summer to early fall. Each flower cluster typically has 5-7 florets. Flowers are very attractive to butterflies. Flowers give way to attractive seed heads which persist well into winter.\n",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "5–6",
    "bloom_time": "summer",
    "native_pollinator": true,
    "rain_garden_wet": true,
    "butterfly_garden": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Filipendula rubra",
    "common_name": "Queen-of-the-prairie",
    "plant_type": "Forb",
    "image": "/plantImgs/filipendula-rubra.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=286417&isprofile=1&basic=Filipendula%20rubra#AllImages",
    "description": "Filipendula rubra, commonly called queen of the prairie, is a U.S. native perennial which ranges from Pennsylvania to Georgia and west to Iowa and Missouri. In Missouri, it is only found in several swampy, calcareous meadows in Reynolds County (Steyermark). It is a very tall, upright, clump-forming perennial that typically grows 6-8' tall and features branched, terminal, astilbe-like, 6-9\" wide panicles (corymbs) of tiny, fragrant, pale pink flowers in early to mid summer. Deeply cut, compound-pinnate, bright green leaves have 7-9 lance-shaped leaflets each, with an unusually large, 7-9 lobed, terminal leaflet (4-8\" long). Leaves are fragrant. A good foliage plant that is valued for both its leaves and its flowers.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–5",
    "bloom_time": "early summer",
    "rain_garden_wet": true,
    "rain_garden_dry": false,
    "bioswale": true,
    "wildlife_keystone": false,
    "ground_cover": false
  },
  {
    "botanical_name": "Geranium maculatum",
    "common_name": "Wild geranium",
    "plant_type": "Forb",
    "image": "/plantImgs/geranium-maculatum.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=c850",
    "description": "Geranium maculatum is a clump-forming, Missouri native, woodland perennial which typically occurs in woods, thickets and shaded roadside areas throughout the State. Forms a mound of foliage that grows to 24\" tall and 18\" wide. Features 1 1/4\" diameter, pink to lilac, saucer-shaped, upward facing, 5-petaled flowers in spring for a period of 6-7 weeks. Deeply cut, palmately 5-lobed, dark green leaves (to 6\" across). Flowers give way to distinctive, beaked seed capsules which give rise to the common name of crane's bill. The maturing seeds are eaten by birds.\n",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "2–2.5",
    "bloom_time": "spring",
    "rain_garden_wet": false,
    "butterfly_garden": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": true
  },

  {
    "botanical_name": "Liatris spicata",
    "common_name": "Dense blazing star",
    "plant_type": "Forb",
    "image": "/plantImgs/liatris-spicata.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=d780#AllImages",
    "description": "Liatris spicata, commonly called blazing star, dense blazing star or marsh blazing star, is a tall, upright, clump-forming perennial which is native to moist low grounds, meadows and marsh margins. In Missouri, it has only been found in Oregon County on the Arkansas border (Steyermark). It typically grows 2-4' tall in cultivation, but can reach a height of 6' in some parts of its native habitat. Features terminal spikes (6-12\" long) of sessile, rounded, fluffy, deep purple flower heads (each to 3/4\" across) appearing atop rigid, erect, leafy flower stalks. One or more stalks arise from a basal tuft of narrow, grass-like, medium green leaves (to 12\" long). Stem leaves gradually decrease in size toward the top. Blooms in summer. The flowers are attractive to hummingbirds, butterflies, and other pollinators, and the small seeds are attractive to songbirds.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "2–3",
    "bloom_time": "summer",
    "rain_garden_wet": false,
    "butterfly_garden": true,
    "bird_haven": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Monarda fistulosa",
    "common_name": "Wild bergamot",
    "plant_type": "Forb",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–4",
    "bloom_time": "summer",
    "bird_haven": true,
    "rain_garden_wet": true,
    "native_pollinator": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Osmunda regalis",
    "common_name": "Royal fern",
    "plant_type": "Fern",
    "image": "/plantImgs/osmunda-regalis.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=l320",
    "description": "Osmunda regalis, commonly called royal fern, is a tall, deciduous, Missouri native fern which usually occurs on moist bluffs and ledges and along streams (sometimes growing in the water), primarily in the southeastern Ozark region of the State. Typically grows in clumps to 2-3' tall, but with constant moisture can reach 6' in height. Broad fronds have large, well-separated pinnae (leaflets) which give this fern an almost pea-family appearance. Fronds typically turn yellow to brown in autumn. Spores are located in brown, tassel-like, fertile clusters at the tips of the fronds, thus giving rise to the additional common name of flowering fern for this plant. Osmunda fiber used in the potting of orchids comes from the fibrous roots of these ferns.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–4",
    "bloom_time": "fall",
    "rain_garden_wet": true,
    "rain_garden_dry": false,
    "bioswale": true,
    "wildlife_keystone": false,
    "ground_cover": false
  },
  {
    "botanical_name": "Rudbeckia fulgida",
    "common_name": "Orange coneflower",
    "plant_type": "Forb",
    "image": "/plantImgs/rudbeckia-fulgida.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=g630",
    "description": "Rudbeckia fulgida is a herbaceous perennial native to the eastern United States which occurs in both dry and moist soils in open woods, glades and thickets. An upright, rhizomatous, clump-forming, free-blooming coneflower which typically grows to 3' tall, often forming colonies in the wild. Features daisy-like flowers (to 2.5\" across) with yellow rays and brownish-purple center disks. Prolific bloom production over a long mid-summer to fall bloom period. Oblong to lanceolate, medium green foliage. Good cut flower. The flowers are attractive to butterflies and other insect pollinators. Birds eat the seeds.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "1–3",
    "butterfly_garden": true,
    "bloom_time": "late summer",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": true
  },
  {
    "botanical_name": "Rudbeckia subtomentosa",
    "common_name": "Sweet coneflower",
    "plant_type": "Forb",
    "image": "/plantImgs/rudbeckia-subtomentosa.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=g640",
    "description": "Rudbeckia subtomentosa, commonly called sweet coneflower, is a Missouri native, nonrhizomatous perennial which occurs on moist prairies, along streambanks and in low areas throughout the state. Typically grows 3-5' tall and features daisy-like flowers (to 3\" across) with yellow rays and dark brownish-purple center disks on branched stems. Flowers have a mild aroma of anise, hence the common name. Toothed, gray-green leaves (lower leaves are 3-lobed) are downy below. Long summer-to-early-fall bloom period.\n",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–5",
    "bloom_time": "summer",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Symphyotrichum-novae-angliae",
    "common_name": "New England aster",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "4–6",
    "bloom_time": "late summer",
    "butterfly_garden": true,
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "native_pollinator": true,
    "ground_cover": false,
    "image": "/plantImgs/symphyotrichum-novaeangliae.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=b540",
    "description": "Symphyotrichum novae-angliae, commonly called New England aster, is a Missouri native perennial which occurs in moist prairies, meadows, thickets, low valleys and stream banks (Steyermark) throughout the State. It is a stout, leafy plant typically growing 3-6' tall with a robust, upright habit. Features a profuse bloom of daisy-like asters (to 1.5\" diameter) with purple rays and yellow centers from late summer to early fall. Rough, hairy, lance-shaped leaves (to 4\" long) clasp stiff, hairy stems. Flowers are attractive to butterflies."
  },
  {
    "botanical_name": "Ilex decidua",
    "common_name": "Deciduous Holly",
    "image": "/plantImgs/ilex-decidua.jpg",
    "url": "https://www.missouribotanicalgarden.org/plantfinder/PlantFinderDetails.aspx?taxonid=276160",
    "description": "Ilex decidua is a Missouri native, deciduous holly that is commonly called possum haw. It occurs on limestone glades and bluffs, along streams in wet woods, and in lowland valleys, sloughs and swamps. An upright shrub with a spreading, rounded crown which typically grows 7-15' tall in cultivation (to 30' in the wild). Obovate, narrow, glossy, dark green leaves (2-3\" long) turn a dull purplish green to yellow in autumn. The whitish flowers of both male and female plants are relatively inconspicuous. Pollinated female flowers give way to orange-red berries which ripen in September and persist throughout the winter until mid-March when new growth begins. Birds, deer and a variety of small mammals (including opossums as the common name suggests) are attracted to the fruit.",
    "plant_type": "Shrub",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "7–10",
    "bloom_time": "summer",
    "bird_haven": true,
    "rain_garden_wet": false,
    "rain_garden_dry": true,
    "bioswale": false,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Ilex verticillata",
    "common_name": "Winterberry holly",
    "image": "/plantImgs/ilex-verticillata.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=d440",
    "description": "Ilex verticillata, commonly called winterberry, is a deciduous holly that is native to eastern North America where it typically occurs in swamps, damp thickets, low woods and along ponds and streams. The form of this plant found in Missouri is Ilex verticillata var. padifolia, which occurs in “shut-ins”, granite rocky stream beds and sandstone bluffs in only 4 counties in the southeastern part of the state (Steyermark). This is a slow-growing, deciduous shrub with an upright-rounded habit that typically grows 6-12’ tall. Mature specimens in the wild can reach upwards of 15'. Often suckers to form large thickets or colonies. The bark is smooth and grey with scattered lenticles. Elliptic to obovate, toothed, dark green leaves will reach 2-3\" long and 1\" wide. Fall color is usually negligible, but in some years leaves may turn attractive shades of maroon. The foliage is a larval food source for the Harris' three-spot and pawpaw sphinx moths. Relatively inconspicuous greenish-white flowers appear in the leaf axils in late spring and are attractive to small bees and flies. Flowers, if properly pollinated, give way to a crop of bright red berries (1/4” diameter) in late summer to fall. Berries are quite showy and will persist throughout the winter and often into early spring. They are an important winter food source for a variety of birds and mammals.\n",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–6",
    "bloom_time": "summer",
    "rain_garden_wet": true,
    "bird_haven": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Sambucus canadensis",
    "common_name": "Elderberry",
    "plant_type": "Shrub",
    "image": "/plantImgs/sambucus-canadensis.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=f470#AllImages",
    "description": "Sambucus canadensis, commonly called American elder, is native to eastern North America. It is a deciduous, somewhat sprawling, suckering shrub that typically grows to 5-12’ tall. It typically occurs on streambanks, moist woodlands, thickets, fence rows and roadsides throughout the State of Missouri. Tiny lemon-scented white flowers appear in large flat-topped clusters (cymes to 10” across) in June. Flowers give way to clusters of black elderberry fruits (drupes) in late summer. Fruits of species plants are sometimes used to make jams, jellies, pie filings and elderberry wine. Fruits are attractive to wildlife. American elder (Sambucus canadensis) and European elder (Sambucus nigra) are closely related plants. Some authorities consider this plant to be a subspecies or variety of Sambucus nigra instead of a separate species.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "8–12",
    "bloom_time": "summer",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bird_haven": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Acer rubrum",
    "common_name": "Red maple",
    "image": "/plantImgs/acer-rubrum.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=j170",
    "description": "Acer rubrum, commonly called red maple, is a medium-sized, deciduous tree that is native to Eastern North America from Quebec to Minnesota south to Florida and eastern Texas. It typically grows 40-60’ tall with a rounded to oval crown. It grows faster than Norway and sugar maples, but slower than silver maple. In northern states, red maple usually occurs in wet bottomland, river flood plains and wet woods, but in Missouri it typically frequents drier, rocky upland areas. Emerging new growth leaves, leafstalks, twigs, flowers, fruit and fall color are red or tinged with red. Quality of red fall color on species plants is variable. Leaves (to 2-5\" long) have 3 principal triangular lobes (sometimes 5 lobes with the two lower lobes being largely suppressed). Lobes have toothed margins and pointed tips. Leaves are medium to dark green above and gray green below. Flowers on a given tree are primarily male or female or monoecious and appear in late winter to early spring (March-April) before the leaves. Fruit is a two-winged samara. The seeds and flower buds are eaten by many species of birds. Caterpillars and other insects which feed on red maples are also a source of food for birds.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "60–70",
    "bloom_time": "spring",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": false,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Asimina triloba",
    "common_name": "Pawpaw",
    "plant_type": "Tree",
    "image": "/plantImgs/asimina-triloba.jpg",
    "url": "",
    "description": "",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "20–30",
    "bloom_time": "spring",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": false,
    "ground_cover": false
  },
  {
    "botanical_name": "Celtis occidentalis",
    "common_name": "Hackberry",
    "image": "/plantImgs/celtis-occidentalis.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=a858",
    "description": "Celtis occidentalis, commonly called common hackberry, is a medium to large sized deciduous tree that typically grows 40-60’ (less frequently to 100’) tall with upright-arching branching and a rounded spreading crown. Trunk diameter ranges from 1-3’ (less frequently to 4’). This tree is a U.S. native that is widely distributed throughout the east and midwest. It is common in Missouri where it typically occurs statewide in low woods along streams and in drier upland slopes (Steyemark). Mature gray bark develops corky ridges and warty texture. Insignificant, mostly monoecious, greenish flowers appear in spring (April–May), with male flowers in clusters and female flowers solitary. Female flowers give way to an often abundant fruit crop of round fleshy berry-like drupes maturing to deep purple. Each drupe has one round brown seed within. Fruits are attractive to a variety of wildlife. Birds consume the fruits and disperse the seeds. Fleshy parts of the fruit are edible and somewhat sweet. Ovate to oblong-ovate, rough-textured, glossy to dull green leaves (2-5” long) have mostly uneven leaf bases and are coarsely toothed from midleaf to acuminate (sharply pointed) tip. Undistinguished yellow fall color.\n",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "50–60",
    "bloom_time": "spring",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Quercus bicolor",
    "common_name": "Swamp white oak",
    "plant_type": "Tree",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "40–50",
    "bloom_time": "spring",
    "butterfly_garden": true,
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Quercus macrocarpa",
    "common_name": "Bur oak",
    "plant_type": "Tree",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "60–80",
    "bloom_time": "spring",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Quercus phellos",
    "common_name": "Willow oak",
    "plant_type": "Tree",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "40–50",
    "bloom_time": "spring",
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Tilia americana",
    "common_name": "American basswood",
    "image": "/plantImgs/tilia-americana.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=a917#AllImages",
    "description": "Tilia americana, commonly called American basswood or American linden, is a medium to large deciduous tree which typically grows to 50-80’ (infrequently to over 100’) tall with an ovate-rounded crown. It is native to a variety of habitats from Quebec to the southeastern corner of Manitoba and far eastern North Dakota south to Oklahoma, Tennessee and North Carolina, with concentrations in forested areas of the Appalachian Mountains and along the Ohio River Valley to Missouri. Trees are found in both dry upland areas as well as moist, low woods. In Missouri, this tree typically occurs in rich woods, slopes, bluff bases and along streams throughout the State (Steyermark). This tree is noted for its (a) cymes of fragrant, pale yellow, late spring flowers, (b) small nutlets which follow the flowers and ripen by late summer, (c) mucilaginous sap, (d) noticeable winter buds, and (e) large ovate dark green leaves (to 6” long) with acuminate tips, serrate margins, often silvery undersides and uneven cordate bases. Flowers bloom in June in 5-10 flowered cymes. Each cyme droops from a showy, papery, narrow, leaf-like bract (to 5” long) where it is attached to the bract at a point somewhere between the base and midpoint. When a tree is in full bloom, bees often visit in such abundant numbers that humming can be heard many feet from the tree. Honey made from the nectar of these flowers is a prized gourmet item. Flowers have also been used to make tea. Syrup can be made from the sweet tree sap. Fall color is an undistinguished pale green to pale yellow. Winter twigs and buds are sometimes tinged with red.",
    "soil_type": "moist",
    "full_sun": "X",
    "part_shade": "X",
    "bird_haven": true,
    "full_shade": "X",
    "height": "50–80",
    "bloom_time": "summer",
    "native_pollinator": true,
    "rain_garden_wet": true,
    "rain_garden_dry": true,
    "bioswale": true,
    "wildlife_keystone": true,
    "ground_cover": false
  },
  {
    "botanical_name": "Asclepias tuberosa",
    "common_name": "Butterfly milkweed",
    "plant_type": "Forb",
    "image": "/plantImgs/asclepias-tuberosa.jpg",
    "url":"https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=b490",
    "description": "Asclepias tuberosa, commonly called butterfly weed, is a tuberous rooted, Missouri native perennial which occurs in dry/rocky open woods, glades, prairies, fields and roadsides throughout the State (Steyermark). It typically grows in a clump to 1-2.5' tall and features clusters (umbels) of bright orange to yellow-orange flowers atop upright to reclining, hairy stems with narrow, lance-shaped leaves. Unlike many of the other milkweeds, this species does not have milky-sapped stems. Flowers give way to prominent, spindle-shaped seed pods (3-6\" long) which split open when ripe releasing numerous silky-tailed seeds for dispersal by the wind. Seed pods are valued in dried flower arrangements. Long bloom period from late spring throughout the summer. Flowers are a nectar source for hummingbirds, butterflies and many other pollinators, and leaves are a food source for monarch butterfly larvae (caterpillars).",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "2–2.5",
    "bloom_time": "summer",
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Echinacea pallida",
    "common_name": "Pale purple coneflower",
    "image": "/plantImgs/echinacea-pallida.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=c570",
    "description": "Echinacea pallida, commonly known as pale purple coneflower, is a coarse, hairy perennial of prairies, savannahs, glades and open dry rocky woods from Nebraska to Michigan south to Georgia and Texas. It features narrow, parallel-veined, toothless, dark green leaves (4-10” long) and large, daisy-like flowers with drooping, pale pinkish-purple petals (ray flowers) and spiny, knob-like, coppery-orange center cones. Flowers appear on rigid stems to 2-3’ (less frequently to 4’) tall over a long summer bloom. This species is distinguished by (a) thin, extremely-reflexed rays which almost droop straight down and (b) very narrow, parallel-veined leaves which have no teeth. Best flower display is in late June to late July, with sporadic continued bloom into autumn.",
    "plant_type": "Forb",
    "butterfly_garden": true,
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–4",
    "bloom_time": "summer",
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Echinacea purpurea",
    "common_name": "Purple coneflower",
    "image": "/plantImgs/echinacea-purpurea.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=c580",
    "description": "Echinacea purpurea, commonly called purple coneflower, is a coarse, rough-hairy, herbaceous perennial that is native to moist prairies, meadows and open woods of the central to southeastern United States (Ohio to Michigan to Iowa south to Louisiana and Georgia). It typically grows to 2-4' tall. Showy daisy-like purple coneflowers (to 5\" diameter) bloom throughout summer atop stiff stems clad with coarse, ovate to broad-lanceolate, dark green leaves. Good fresh cut or dried flower. The dead flower stems will remain erect well into the winter, and if flower heads are not removed, the blackened cones may be visited by goldfinches or other birds that feed on the seeds.",
    "plant_type": "Forb",
    "soil_type": "dry",
    "butterfly_garden": true,
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "bird_haven": true,
    "height": "3–4",
    "bloom_time": "summer",
    "native_pollinator": true,
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Liatris pycnostachya",
    "common_name": "Prairie blazing star",
    "image": "/plantImgs/liatris-pycnostachya.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=d770",
    "description": "Liatris pycnostachya, commonly called prairie blazing star, is perhaps the tallest Liatris species in cultivation, typically growing 2-4' tall (infrequently to 5'). It is an upright, clump-forming, Missouri native perennial which commonly occurs in prairies, open woods, meadows and along railroad tracks and roads. Features rounded, fluffy, deep rose-purple flower heads (each to 3/4\" across) which are crowded into terminal spikes (to 20\" long) atop thickly-leafed, rigid flower stalks. Stalks arise from basal tufts of narrow, lance-shaped leaves (to 12\" long). Flowers generally open top to bottom on the spikes. Blooms in summer. The flowers are attractive to hummingbirds, butterflies, and other pollinators, and the small seeds are attractive to songbirds. This species is distinguished from other Liatris species by its reflexed, long-tipped involucral bracts.",
    "plant_type": "Forb",
    "butterfly_garden": true,
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–4",
    "bloom_time": "spring",
    "ground_cover": true,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Monarda bradburiana",
    "common_name": "Bradbury beebalm",
    "plant_type": "Forb",
    "image": "/plantImgs/monarda.jpg",
    "description": "Monarda bradburiana (Eastern Beebalm) and Monarda fistulosa (Wild Bergamot) are both bee balm species, but they have key differences in their size, habit, and flowering times. Monarda bradburiana is shorter, clumping, and blooms earlier in the season compared to Monarda fistulosa, which is taller and spreads more by underground runners.",
    "url": "https://mdc.mo.gov/discover-nature/field-guide/wild-bergamot",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "butterfly_garden": true,
    "height": "1–3",
    "bloom_time": "spring",
    "ground_cover": true,
    "wildlife_keystone": false
  },
  {
    "botanical_name": "Rudbeckia hirta",
    "common_name": "Black-eyed Susan",
    "image": "/plantImgs/rudbeckia-hirta.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=277225",
    "description": "Rudbeckia hirta, commonly called black-eyed Susan, is a common Missouri native wildflower which typically occurs in open woods, prairies, fields, roadsides and waste areas throughout the State. It is a coarse, hairy, somewhat weedy plant that features daisy-like flowers (to 3” across) with bright yellow to orange-yellow rays and domed, dark chocolate-brown center disks. Blooms throughout the summer atop stiff, leafy, upright stems growing 1-3’ tall. Rough, hairy, lance-shaped leaves (3-7” long). Plants of this species are sometimes commonly called gloriosa daisy, particularly the larger-flowered cultivars that come in shades of red, yellow, bronze, orange and bicolors.\n",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "2–3",
    "bloom_time": "summer",
    "bird_haven": true,
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Salvia azurea",
    "common_name": "Blue sage",
    "plant_type": "Forb",
    "image": "/plantImgs/salvia-azurea.jpg",
    "description": "Salvia azurea, commonly called blue sage, is a clump-forming perennial that typically grows to 3-5’ tall (shorter if pruned). Whorls of 2-lipped, azure blue flowers bloom in spikes from mid-summer to fall atop stiff stems clad with linear to lanceolate to obovate, grayish-green leaves (to 3-4” long). Salvia azurea var. azurea is native from North Carolina and Tennessee south to Florida and Texas. Salvia azurea var. grandiflora grows further west to New Mexico and further north to Nebraska and Minnesota. Although similar in appearance, var. grandiflora has larger flowers and is often considered to be a better garden plant than var. azurea.\n\nThe genus name Salvia comes from the Latin word salveo meaning \"to save or heal\", in reference to the purported medically curative properties attributed to some plants in the genus.\n",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=281504",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "3–5",
    "bloom_time": "summer",
    "bird_haven": true,
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Symphyotrichum oblongifolium",
    "common_name": "Aromatic aster",
    "image": "/plantImgs/symphyotrichum-oblongifolium.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=j490#AllImages",
    "description": "Symphyotrichum oblongifolium, commonly called aromatic aster, is a Missouri native plant that typically occurs on limestone glades, slopes, prairies and dry open ground. A bushy, stiff, compact, low-growing plant with hairy stems. Typically grows 1-2' (infrequently to 3') tall and features small, daisy-like flowers (1\" across) with violet blue rays and yellow center disks. Long bloom period that lasts into late fall. Rigid, toothless, oblong, blue-green leaves (to 4\" long) are, as the common name suggests, fragrant when crushed. Good cut flower. Attractive to butterflies.\n",
    "plant_type": "Forb",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "2–3",
    "native_pollinator": true,
    "bloom_time": "fall",
    "bird_haven": true,
    "ground_cover": true,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Callicarpa americana",
    "common_name": "American beautyberry",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "bird_haven": true,
    "full_shade": "X",
    "height": "3–5",
    "bloom_time": "summer",
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Acer saccharum",
    "common_name": "Sugar maple",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "50–80",
    "bloom_time": "spring",
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Juniperus virginiana",
    "common_name": "Eastern red cedar",
    "image": "/plantImgs/juniperus-virginiana.jpg",
    "description": "Juniperus virginiana, commonly called Eastern red cedar, is native to Missouri where it typically occurs on limestone bluffs and glades, wood margins, fields, pastures and fence rows throughout the state except for the southeastern lowlands (Steyermark). It is a broadly conical, sometimes columnar, dense, evergreen conifer with horizontal branching that typically grows to 30-65’ tall. Gray to reddish-brown bark exfoliates in thin shreddy strips on mature trees. Trunks are often fluted at the base. Heartwood is reddish-brown and aromatic, and is commonly used for cedar chests. Dark blue green scale-like foliage. Foliage may turn brown-green in winter. Cultivars of this species often retain better foliage color in winter. This is a dioecious species (separate male and female trees). Female trees produce round, gray to blackish-green berry-like cones (1/4” diameter) that ripen in fall the first year. Berry-like cones are attractive to many birds.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=279605",
    "soil_type": "dry",
    "full_sun": "X",
    "bird_haven": true,
    "part_shade": "X",
    "full_shade": "X",
    "height": "40–50",
    "bloom_time": "spring",
    "ground_cover": false,
    "wildlife_keystone": false
  },
  {
    "botanical_name": "Quercus alba",
    "common_name": "White oak",
    "plant_type": "Tree",
    "soil_type": "dry",
    "full_sun": "X",
    "bird_haven": true,
    "part_shade": "X",
    "full_shade": "X",
    "height": "40–60",
    "bloom_time": "spring",
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Quercus muehlenbergii",
    "common_name": "Chinkapin oak",
    "plant_type": "Tree",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "50–60",
    "bloom_time": "spring",
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Quercus rubra",
    "common_name": "Red oak",
    "plant_type": "Tree",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "50–70",
    "bloom_time": "spring",
    "ground_cover": false,
    "wildlife_keystone": true
  },
  {
    "botanical_name": "Quercus shumardii",
    "common_name": "Shumard oak",
    "plant_type": "Tree",
    "soil_type": "dry",
    "full_sun": "X",
    "part_shade": "X",
    "full_shade": "X",
    "height": "40–60",
    "bloom_time": "spring",
    "ground_cover": false,
    "wildlife_keystone": true
  }
]

